import React, { FC } from 'react';
import cn from 'classnames';
import styles from './landing.scss';

export const LandingPage: FC = () => (
  <main className={cn(styles.landing, 'fullscreen')}>
    <h1 className={styles.landing__title}>Имаджинариум</h1>
    <article>
      <section className={styles['landing-info__item']}>
        <h3>Цель игры</h3>
        <p>
          Опередить соперников и набрать наибольшее количество очков, получить удовольствие и узнать лучше своих друзей.
        </p>
      </section>
      <section className={styles['landing-info__item']}>
        <h3>Ход игры</h3>
        <p>
          Ведущий рассматривает карточки. Из них он выбирает ту, которая вызвала у него самую интересную ассоциацию
          (сложную, но желательно понятную хотя бы одному игроку). Озвучивает ассоциацию другим игрокам.
        </p>
        <p>
          После своего перформанса ведущий кладёт закрытую карту в центр. Участники находят среди своих картинок ту,
          которая ярче других иллюстрирует озвученную ассоциацию, и отправляют ее на стол. Когда все сделали свой выбор,
          ведущий перетасовывает карточки, после этого выкладывает лицом вверх. [Todo: edit]
        </p>
        <p>
          Участники внимательно разглядывают все картинки, стараясь высмотреть ту, которую выложил ведущий. Происходит
          тайное голосование. Все игроки (кроме ведущего) выбирают жетон с цифрой, но не показывают его остальным. По
          команде таблички переворачивают. Происходит подсчёт очков. [Todo: edit]
        </p>
      </section>
      <section className={styles['landing-info__item']}>
        <h3>Определение количества баллов</h3>

        <h4>Перемещение игроков</h4>
        <p>Если игрок угадал карту ведущего, то он получает +3 очка</p>
        <p>
          Если кто-то из соперников отметил карту любого участника, то последний получает соответствующее количество
          очков, вне зависимости от того, обнаружил ли он картинку ведущего. [Todo: edit]
        </p>

        <h4>Перемещение ведущего</h4>
        <p>
          Если ассоциацию ведущего угадал один или несколько игроков, то он получает +3 очка плюс по одной за каждого
          участника.
        </p>
        <p>Если карту ведущего угадали все игроки, или, наоборот, никто – ведущий не получает очков.</p>
      </section>
    </article>
    <button className={styles['landing-play-button']} type='button'>
      Играть
    </button>
  </main>
);
