import { DataPropsItem, DataThemeProps, IdItemTheme } from './types';

export const DataTheme: Record<IdItemTheme, DataPropsItem> = {
  0: {
    id: 0,
    title: 'Тема 1',
    date: '',
  },
  1: {
    id: 1,
    title: 'npm is the world largest software registry.',
    date: '',
  },
  2: {
    id: 2,
    title: 'The CLI runs from a terminal, and is how most developers interact with npm.',
    date: '',
  },
  3: {
    id: 3,
    title:
      'The CLI runs from a terminal, and is how most developers interact with npm. The CLI runs from a terminal, and is how most developers interact with npm.',
    date: '',
  },
};

export const DataThemeComments: DataThemeProps = {
  title: 'Заголовок выбранной темы',
  comments: [
    {
      id: 0,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
    {
      id: 1,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
    {
      id: 2,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
    {
      id: 3,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
  ],
};
