import { DataThemeProps } from './types';

export const DataThemeComments: DataThemeProps = {
  title: 'Заголовок выбранной темы',
  comments: [
    {
      id: 0,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
    {
      id: 1,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
    {
      id: 2,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
    {
      id: 3,
      author: 'author',
      message:
        'Безусловно, семантический разбор внешних противодействий позволяет оценить значение укрепления моральных ценностей. Но элементы политического процесса преданы социально-демократической анафеме. Господа, понимание сути ресурсосберегающих технологий обеспечивает актуальность инновационных методов управления процессами.',
      date: 'date',
    },
  ],
};
